tap "agavra/tap"
tap "andyrewlee/amux"
tap "anomalyco/tap"
tap "asheshgoplani/tap"
tap "brewforge/extras"
tap "brizzai/tap"
tap "charmbracelet/tap"
tap "coollabsio/jean"
tap "dlvhdr/formulae"
tap "harelba/q"
tap "hashicorp/tap"
tap "multica-ai/tap"
tap "raine/claude-history"
tap "runfusion/fusion"
tap "sortie-ai/tap"
tap "sst/tap", "https://github.com/anomalyco/homebrew-tap.git"
tap "stablyai/orca"
tap "umputun/apps"
tap "zippoxer/tap"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Query anything with SQL
brew "anyquery"
# Text-based UI library
brew "ncurses"
# Terminal multiplexer
brew "tmux"
# Terminal session manager for AI coding agents
brew "aoe"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage multiple AI agents like Claude Code, Aider and Codex in your terminal
brew "claude-squad"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Terminal application to manage Docker and Docker Swarm
brew "dry"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Data validation using Python type hints
brew "pydantic"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# GNU database manager
brew "gdbm"
# Portable Foreign Function Interface library
brew "libffi"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Framework for layout and rendering of i18n text
brew "pango"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Manage your git repositories in one place
brew "gitbatch"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Alternative to top/htop
brew "glances"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Tag generator for Go, compatible with ctags
brew "gotags"
# Ping, but with a graph
brew "gping"
# AI assistant in your terminal
brew "gptme"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Kubernetes package manager
brew "helm"
# Ncurses-based console hex editor
brew "hexcurse"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Command-line editor
brew "id3v2"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Selection-based modal text editor
brew "kakoune"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Terminal file manager
brew "lf"
# Implementation of Microsoft's Media Transfer Protocol (MTP)
brew "libmtp"
# Access large language models from the command-line
brew "llm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# Like jq but for Markdown
brew "mdq"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Jq-like command-line tool for markdown processing
brew "mq"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Terminal client for Ollama
brew "oterm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Modern replacement for ps written in Rust
brew "procs"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Intuitive find & replace CLI
brew "sd"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Text interface for Git repositories
brew "tig"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Tree command, improved
brew "tre-command"
# Maintained ctags implementation
brew "universal-ctags"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# CSV CLI magician written in Rust
brew "xan"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# In terminal graphical metrics for your *nix system
brew "zenith"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# TUI for running parallel coding agents
brew "andyrewlee/amux/amux", trusted: true
# Terminal session manager for AI coding agents
brew "asheshgoplani/tap/agent-deck", trusted: true
# Multica CLI — local agent runtime and management tool for the Multica platform
brew "multica-ai/tap/multica", trusted: true
# Fusion — AI-orchestrated task board. From rough idea to production code, automatically
brew "runfusion/fusion/fusion", trusted: true
# Spec-first orchestration service for coding agents
brew "sortie-ai/tap/sortie", trusted: true
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AI assistant and MCP client
cask "5ire"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Communications service
cask "amazon-chime"
# Private desktop AI chat application
cask "anythingllm"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Manage team projects and tasks
cask "asana"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organiser
cask "bartender"
# Display management tool
cask "betterdisplay"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# AI chat client
cask "boltai"
# Web browser focusing on privacy
cask "brave-browser"
# Open-source agentic browser
cask "browseros"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# AI chatbot for many LLMs
cask "chatwise"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Screen capturing tool
cask "cleanshot"
# Claude code parallelisation
cask "conductor"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Write, edit, and chat about your code with AI
cask "cursor"
# Menu bar weather app
cask "datweatherdoe"
# AI assistant
cask "deepchat"
# All-in-one toolbox for developers
cask "devutils"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Utility that prevents the system from going to sleep
cask "domzilla-caffeine"
# Podcast client
cask "doughnut"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# TUI for managing multiple Claude Code sessions in parallel
cask "brizzai/tap/fleet", trusted: true
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-roboto"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Virtual globe
cask "google-earth-pro"
# Online meetings, desktop sharing, and video conferencing
cask "gotomeeting"
# Run LLMs locally
cask "gpt4all"
# Graphically shows disk usage within a file system
cask "grandperspective"
# AI-powered notepad for meetings
cask "granola"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar calendar
cask "itsycal"
# Offline AI chat tool
cask "jan"
# AI Assistant desktop application
cask "coollabsio/jean/jean", trusted: true
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# App to manage software development and track bugs
cask "linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Text editor
cask "macvim-app"
# Speech recognition tool
cask "macwhisper"
# Software used to make Minecraft Java Edition mods
cask "mcreator"
# Visual diff and merge tool
cask "meld"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Run Stable Diffusion natively
cask "mochi-diffusion"
# CSV editor
cask "modern-csv"
# VPN client
cask "mullvad-vpn"
# Visual online collaboration platform
cask "mural"
# Neovim Client
cask "neovide-app"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# GUI app and toolkit for Claude Code
cask "opcode"
# Tool for working with messy data (previously Google Refine)
cask "openrefine"
# IDE for orchestrating AI coding agents across terminals and worktrees
cask "stablyai/orca/orca", trusted: true
# WebKit based web browser
cask "orion"
# Visual client for Helix Core
cask "p4v"
# Network monitoring tool
cask "pingplotter"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Tool for teams to create living documents
cask "quip"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# Control your tools with a few keystrokes
cask "raycast"
# Screen recorder with audio
cask "screenflick"
# GUI for Claude Code
cask "sculptor"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Run multiple Claude Code instances simultaneously using git worktrees
cask "stravu-crystal"
# Native terminal coding agents command center
cask "supacode"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Lightweight CSV editor
cask "tablecruncher"
# Customizable timing of breaks
cask "time-out"
# Control your data usage on slow or expensive networks
cask "tripmode"
# Multimedia player
cask "vlc"
# Voice to text app
cask "voiceink"
# Video communication and virtual meeting platform
cask "webex"
# Native desktop client for WhatsApp
cask "whatsapp"
# BYOK (Bring Your Own Keys) AI assistant
cask "witsy"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
mas "Awareness", id: 1497695227
mas "Camera Graph", id: 6450550518
mas "Diagrams", id: 1276248849
mas "Draw Things", id: 6444050820
mas "focusWindow", id: 1444457097
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Hand Mirror", id: 1502839586
mas "Horo", id: 1437226581
mas "Hour", id: 569089415
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanguageTool", id: 1534275760
mas "MindNode", id: 6446116532
mas "MindNode Classic", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Pixelmator Pro", id: 1289583905
mas "Polarr Photo Editor Pro", id: 1058273036
mas "Publisher Master - Graphic Design & Page Layout Creator", id: 998756839
mas "Quip", id: 1003160018
mas "Solves", id: 1394359548
mas "Spokenly", id: 6740315592
mas "Swift Publisher 5", id: 1058362543
mas "TickTick", id: 966085870
mas "Webcam Effects", id: 1525288396
mas "Webcam Settings", id: 533696630
mas "WhatsApp", id: 310633997
mas "xcribe", id: 6743496546
vscode "anysphere.remote-ssh"
vscode "vscodevim.vim"
go "cmd/go"
go "cmd/gofmt"
npm "@aoagents/ao"
npm "@tobilu/qmd"
npm "agents-shire"
npm "ccusage"
npm "cldctrl"
npm "corepack"
npm "dmux"
