tap "brewforge/extras"
tap "charmbracelet/tap"
tap "harelba/q"
tap "homebrew/bundle"
tap "homebrew/services"
tap "sst/tap"
brew "antigen"
brew "anyquery"
brew "xz"
brew "git"
brew "asdf"
brew "automake"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "aws-shell"
brew "awscli"
brew "bat"
brew "block-goose-cli"
brew "bottom"
brew "colordiff"
brew "gmp"
brew "coreutils"
brew "ctop"
brew "dive"
brew "dry"
brew "duf"
brew "dust"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "node", link: false
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "gitbatch"
brew "gitui"
brew "glances"
brew "pinentry"
brew "gnupg"
brew "gotags"
brew "gping"
brew "gptme"
brew "libtool"
brew "graphviz"
brew "gron"
brew "hexcurse"
brew "hexyl"
brew "ncurses"
brew "htop"
brew "hub"
brew "icdiff"
brew "id3v2"
brew "jless"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "lf"
brew "libffi"
brew "llm"
brew "lnav"
brew "mas"
brew "md5sha1sum", link: false
brew "miller"
brew "mtr"
brew "mycli"
brew "mysql", restart_service: :changed
brew "ncdu"
brew "nmap"
brew "oterm"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pkgconf"
brew "prettyping"
brew "procs"
brew "python@3.10"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "s3cmd"
brew "sd"
brew "starship"
brew "switchaudio-osx"
brew "tealdeer"
brew "texlive"
brew "tig"
brew "tilt"
brew "tokei"
brew "topgrade"
brew "tre-command"
brew "universal-ctags"
brew "uv"
brew "wget"
brew "xan"
brew "xh"
brew "yt-dlp"
brew "zenith"
brew "zoxide"
brew "zsh"
brew "charmbracelet/tap/crush"
brew "sst/tap/opencode"
cask "1password-cli"
cask "5ire"
cask "adobe-acrobat-reader"
cask "amazon-chime"
cask "anythingllm"
cask "appcleaner"
cask "arc"
cask "asana"
cask "audacity"
cask "bartender"
cask "block-goose"
cask "boltai"
cask "camo-studio"
cask "chatgpt"
cask "chatwise"
cask "cherry-studio"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "conductor"
cask "cursor"
cask "datweatherdoe"
cask "deepchat"
cask "devutils"
cask "diffusionbee"
cask "discord"
cask "docker-desktop"
cask "doughnut"
cask "dropbox"
cask "firefox"
cask "flowdown"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-roboto"
cask "fontsmoothingadjuster"
cask "google-chrome"
cask "google-drive"
cask "google-earth-pro"
cask "gotomeeting"
cask "gpt4all"
cask "grandperspective"
cask "granola"
cask "handbrake-app"
cask "iina"
cask "imageoptim"
cask "itsycal"
cask "jan"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "latest"
cask "lm-studio"
cask "macvim-app"
cask "macwhisper"
cask "mcreator"
cask "meld"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mmhmm"
cask "mochi-diffusion"
cask "modern-csv"
cask "msty"
cask "mural"
cask "notunes"
cask "numi"
cask "ollama-app"
cask "opcode"
cask "openrefine"
cask "orion"
cask "p4v"
cask "pingplotter"
cask "prefs-editor"
cask "quitter"
cask "raycast"
cask "screenflick"
cask "send-to-kindle"
cask "signal"
cask "skype"
cask "spotify"
cask "stats"
cask "steam"
cask "stravu-crystal"
cask "superwhisper"
cask "tablecruncher"
cask "ticktick"
cask "time-out"
cask "tripmode"
cask "vlc"
cask "voiceink"
cask "webex"
cask "whatsapp"
cask "witsy"
cask "yubico-yubikey-manager"
cask "zed"
cask "zen"
mas "Awareness", id: 1497695227
mas "Diagrams", id: 1276248849
mas "Draw Things", id: 6444050820
mas "focusWindow", id: 1444457097
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Hand Mirror", id: 1502839586
mas "Horo", id: 1437226581
mas "Hour", id: 569089415
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanguageTool", id: 1534275760
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Pixelmator Pro", id: 1289583905
mas "Polarr Photo Editor Pro", id: 1058273036
mas "Publisher Master - Graphic Design & Page Layout Creator", id: 998756839
mas "Quip", id: 1003160018
mas "Recasto", id: 1144192021
mas "Solves", id: 1394359548
mas "Spokenly", id: 6740315592
mas "Swift Publisher 5", id: 1058362543
mas "TickTick", id: 966085870
mas "To FLAC Converter 2", id: 1057068364
mas "To MP3 Converter 2", id: 983472324
mas "UPDF", id: 1619925971
mas "Webcam Settings", id: 533696630
mas "WhatsApp", id: 310633997
mas "xcribe", id: 6743496546
vscode "vscodevim.vim"
